#+title: Data Science

[[file:../../homepage.org][Homepage]] / [[file:../../notes.org][Notes]] / [[file:../computer-science.org][Computer Science]] / Data Science

*** Exploration
#+begin_src python :results verbatim
import pandas as pd
return pd.read_csv("~/tmp/train_routes.csv")
#+end_src

#+RESULTS:
:            route_id     origin destination price
: 0   paris-marseille      Paris   Marseille   $65
: 1   marseille-paris  Marseille       Paris   $65
: 2  montreal-toronto   Montreal     Toronto   $45
: 3  toronto-montreal    Toronto    Montreal   $45
: 4   montreal-ottawa   Montreal      Ottawa   $35
: 5   ottawa-montreal     Ottawa    Montreal   $35
: 6    ottawa-toronto     Ottawa     Toronto   $30
: 7    toronto-ottawa    Toronto      Ottawa   $30

#+begin_src python :results silent
import pandas as pd
df = pd.read_csv("~/tmp/train_routes.csv")
df.to_parquet("~/tmp/train_routes.parquet")
#+end_src

#+begin_src python :results verbatim
import pandas as pd
return pd.read_parquet("~/tmp/train_routes.parquet")
#+end_src

#+RESULTS:
:            route_id     origin destination price
: 0   paris-marseille      Paris   Marseille   $65
: 1   marseille-paris  Marseille       Paris   $65
: 2  montreal-toronto   Montreal     Toronto   $45
: 3  toronto-montreal    Toronto    Montreal   $45
: 4   montreal-ottawa   Montreal      Ottawa   $35
: 5   ottawa-montreal     Ottawa    Montreal   $35
: 6    ottawa-toronto     Ottawa     Toronto   $30
: 7    toronto-ottawa    Toronto      Ottawa   $30

